{
    "projects": [
        {
            "title": "FitFeed",
            "description": "FitFeed is a gym mobile app which allows users to track their workouts and share them online with other people (this is like Strava but tailored for the gym expierience).\n\nIt allows you to keep track of your own physique and track your friends and nag them if they are slacking off.\n\nThere are also weekly activity tracker boards to incentivize users to workout. It uses Firebase Storage to store user generated content such as workouts and images, Google Auth for sign-in and camera related libraries.\n\nThe app is made natively for android and ios in React Native.\n\nThe project is something I am currently working on, and the source code is available on GitHub.",
            "image": "banners/FitFeed.png",
            "tags": [
                "React Native",
                "Firebase",
                "Google Cloud",
                "Async Storage",
                "Camera",
                "Mobile"
            ],
            "link": "https://github.com/Artyom-G/FitFeed",
            "playable": false,
            "embed": "<GistEmbed></GistEmbed>"
        },
        {
            "title": "Mitosis Stage Cell ML Image Sorter",
            "description": "Solo developed a Deep Learning program capable of sorting images of different mitosis stages of cells.\n\nProgram based on Convolutional Networks.\n\nThis is a cell image sorter which categorizes pictures based on their mitosis stages\n\nIt was built in TensorFlow and Google Colabs. The model allows to be retrained on different image catgories not just cell mitosis\n\nThe idea behind this project is to help medical cancer research identity cells that may be developing too quickly.",
            "image": "banners/ML_Image_Sorter.jpg",
            "tags": [
                "Python",
                "Tensorflow",
                "Google Colabs",
                "Machine Learning"
            ],
            "link": "https://drive.google.com/file/d/18-1wQcQyEbK7ry8htFwO05ebDA2qyWfj/view?usp=sharing",
            "playable": false,
            "embed": "<GistEmbed></GistEmbed>"
        },
        {
            "title": "Tower Defense 2",
            "description": "Lead a team of students to develop an isometric tower defense game built in Unity.\n\nWelcome to Tower Defense 2, a thrilling 2D top-down pixel isometric tower defense.\n\nOriginally made in Unity, this project showcases my skills in game engines, object-oriented programming and cloud syncing with Plastic SCM.\n\nThe game features infinite waves on enemies that exponentially scale in difficulty. Do not let a single enemy through!",
            "image": "banners/Tower_Defense_2.jpg",
            "tags": [
                "Unity",
                "Plastic SCM",
                "C#",
                "OOP",
                "Piskel",
                "Tilemaps"
            ],
            "link": "https://artyomg.itch.io/tower-defense",
            "playable": true,
            "embed": "<iframe src='https://i.simmer.io/@TurboKozel/tower-defense-2' width='1100' height='660' frameborder='0' scrolling='no'></iframe>"
        },
        {
            "title": "willchai.com",
            "description": "Was commissioned to create a custom portfolio website for a McMaster Health Science Student.\n\nUsed Git and GitHub to collaboratively contribute to the custom React.js Website.\n\nJust like the site you are on right now, this website supports desktop, tablet and mobile displays.",
            "image": "banners/willchai.com.jpg",
            "tags": [
                "React",
                "Cybrancee",
                "Plesk",
                "JavaScript"
            ],
            "link": "https://github.com/Artyom-G/willchai.com",
            "playable": true,
            "embed": "<iframe src='https://willchai.com' width='1400' height='800' frameborder='0'></iframe>"
        },
        {
            "title": "Commercial Photography Website",
            "description": "This website was created for my photography business, just like the website you are on right now.\n\nIt was built using React.js and hosted via Cybrancee. Includes an email contact form, downloadable content among other features.\n\nThis website helped me score a handful of clients as a photographer and continues to serve as a great business card to this day.",
            "image": "banners/photo.artyomg.com.jpg",
            "tags": [
                "React",
                "Cybrancee",
                "Plesk",
                "Email Contact Form",
                "JavaScript"
            ],
            "link": "https://photo.artyomg.com",
            "playable": true,
            "embed": "<iframe src='https://photo.artyomg.com' width='1100' height='660' frameborder='0'></iframe>"
        },
        {
            "title": "EcoSim",
            "description": "Welcome to an ecological simulator\n\nThe purpose of this project is to simulate the advancements of biological species as they grow together and form balanced populations, keeping each other in check.\n\nThe simulation feautures predator and prey each having through own hunger, thirst and reproductive erge meters.",
            "image": "banners/EcoSim.jpg",
            "tags": [
                "Unity",
                "C#",
                "Blender",
                "Perlin Noise"
            ],
            "link": "https://artyomg.itch.io/ecosim",
            "playable": false,
            "embed": ""
        },
        {
            "title": "Reddit to Instagram Bot",
            "description": "An automated system that performs operations on fixed schedule.\n\nAutomate your online presence on Instagram with this auto-post bot.\n\nThe bot is scheduled to post to Instagram on regular time intervals.\n\nIt stores your future posts in Firebase Storage and is then executed via Google Cloud using PRAW and Instagram APIs.",
            "image": "banners/Reddit_to_Instagram_Bot.jpg",
            "tags": [
                "Python",
                "Firebase",
                "Google Cloud",
                "Selenium Webdriver",
                "Instagram API",
                "PRAW"
            ],
            "link": "https://replit.com/@ArtyomGabtraupo/Instagram-Bot",
            "playable": false,
            "embed": ""
        },
        {
            "title": "Hexapawn AI",
            "description": "Initially, this hexapawn bot may seem to be doing random plays but it soons learns your patterns and quickly adapts to your playstyle\n\nIt takes just a few games in and the bot has completely learned all the best strategies, good luck getting a win, 10 round in.",
            "image": "banners/Hexapawn_AI.jpg",
            "tags": [
                "Unity",
                "C#",
                "Machine Learning"
            ],
            "link": "https://artyomg.itch.io/chess-but-but-awesome",
            "playable": true,
            "embed": "<iframe src='https://i.simmer.io/@TurboKozel/hexapawn-ai' style='width:1000px;height:562px'></iframe>"
        },
        {
            "title": "Pokemon Showdown Minimax AI Bot",
            "description": "Enter the arena of competitive Pokemon battles with confidence, armed with our advanced Minimax Bot.\n\nDeveloped in Python and integrated with the Showdown API, this AI-driven bot employs a modified minimax algorithm optimized for speed-based fighting systems.\n\nWhether you're honing your skills or challenging the elite, unleash the power of strategic AI to dominate the battlefield and claim victory in the fast-paced world of Pokemon Showdown.",
            "image": "banners/Pokemon_Showdown_Bot.jpg",
            "tags": [
                "Python",
                "Showdown API",
                "Advanced Algorithms"
            ],
            "link": "",
            "playable": false,
            "embed": ""
        }
    ]
}